In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
engine = create_engine('postgresql://root:root@localhost:5432/ny_taxi')

## Question 3. Count records 

How many taxi trips were there on January 15?

In [3]:
pd.read_sql("""
    SELECT COUNT(*)
    FROM yellow_taxi_data
    WHERE EXTRACT(DAY FROM tpep_pickup_datetime) = 15;
    """, engine)

   count
0  53024

## Question 4. Average

Find the largest tip for each day. 
On which day it was the largest tip in January?

(note: it's not a typo, it's "tip", not "trip")

In [5]:
pd.read_sql("""
    SELECT tpep_pickup_datetime, tip_amount
    FROM yellow_taxi_data
    ORDER BY tip_amount DESC
    LIMIT 1;
""", engine)

  tpep_pickup_datetime  tip_amount
0  2021-01-20 11:22:05     1140.44

## Question 5. Most popular destination

What was the most popular destination for passengers picked up 
in central park on January 14?

Enter the zone name (not id). If the zone name is unknown (missing), write "Unknown"

In [8]:
pd.read_sql("""
    SELECT "Zone" 
    FROM zones
    WHERE "LocationID" = (
        SELECT "DOLocationID"
        FROM yellow_taxi_data
        WHERE EXTRACT(DAY FROM tpep_pickup_datetime) = 14
        GROUP BY "DOLocationID"
        ORDER BY COUNT(*) DESC
        LIMIT 1);
""", engine)

                    Zone
0  Upper East Side North

## Question 6. 

What's the pickup-dropoff pair with the largest 
average price for a ride (calculated based on `total_amount`)?

Enter two zone names separated by a slash

For example:

"Jamaica Bay / Clinton East"

In [6]:
pd.read_sql("""
    SELECT "PULocationID", "DOLocationID", AVG(total_amount)
    FROM yellow_taxi_data
    GROUP BY "PULocationID", "DOLocationID"
    ORDER BY AVG(total_amount) DESC
    LIMIT 1;
""", engine)

   PULocationID  DOLocationID     avg
0             4           265  2292.4

In [7]:
pd.read_sql("""
    SELECT "Zone" 
    FROM zones
    WHERE "LocationID" IN (4,265)
""", engine)

            Zone
0  Alphabet City
1           None